const schoolCategoryMajor = {
  "浙江大学": {
    "工学": [
      "计算机科学与技术",
      "电气工程及其自动化",
      "土木工程",
      "自动化",
      "过程装备与控制工程",
      "电子科学与技术",
      "化学工程与工艺",
      "环境科学",
      "软件工程",
      "电子信息工程",
      "能源与环境系统工程",
      "工业设计",
      "信息工程",
      "生物医学工程",
      "材料科学与工程",
      "建筑学",
      "信息安全",
      "农业工程",
      "食品科学与工程",
      "光电信息科学与工程",
      "机器人工程",
      "海洋工程与技术",
      "车辆工程",
      "生物工程",
      "机械工程",
      "工程力学",
      "城乡规划",
      "飞行器设计与工程",
      "土木、水利与交通工程"
    ],
    "理学": [
      "数学与应用数学",
      "物理学",
      "生物科学",
      "信息与计算机科学",
      "化学",
      "统计学",
      "生态学",
      "心理学",
      "地质学",
      "海洋科学",
      "大气科学",
      "生物信息学",
      "地理信息学"
    ],
    "经济学": [
      "国际经济贸易",
      "金融学",
      "财政学",
      "经济学"
    ],
    "管理学": [
      "农业经济管理",
      "劳动与社会保障",
      "行政管理",
      "工商管理",
      "信息管理与信息系统",
      "会计学",
      "土地资源管理",
      "信息资源管理"
    ],
    "医学": [
      "临床医学",
      "临床医学（儿科）",
      "药学",
      "生物医学",
      "预防医学",
      "口腔医学"
    ],
    "法学": [
      "法学",
      "社会学",
      "马克思主义理论",
      "政治学与行政学"
    ],
    "哲学": [
      "哲学"
    ],
    "文学": [
      "汉语言文学",
      "新闻学",
      "英语",
      "古典文献学",
      "翻译",
      "日语",
      "德语",
      "俄语",
      "传播学",
      "西班牙语"
    ],
    "农学": [
      "农业资源与环境",
      "植物保护",
      "动物科学",
      "园艺",
      "茶学",
      "园林",
      "农学",
      "动物医学",
      "生物育种科学"
    ],
    "历史学": [
      "考古学",
      "历史学",
      "文物与博物馆学"
    ],
    "教育学": [
      "教育学",
      "运动训练",
      "体育教育",
      "智能体育工程"
    ],
    "艺术学": [
      "艺术与科技"
    ]
  },
  "浙江工业大学": {
    "工学": [
      "生物工程",
      "制药工程",
      "化学工程与工艺",
      "网络工程",
      "自动化",
      "通信工程",
      "软件工程",
      "车辆工程",
      "生物制药",
      "环境科学",
      "环境工程",
      "机械工程",
      "智能建造",
      "工业设计",
      "安全工程",
      "城乡规划",
      "土木工程",
      "机器人工程",
      "能源化工工程",
      "电子信息工程",
      "数字媒体技术",
      "食品质量与安全",
      "食品科学与工程",
      "材料科学与工程",
      "智能科学与技术",
      "高分子材料与工程",
      "计算机科学与技术",
      "给排水科学与工程",
      "机械工程（师范）",
      "过程装备与控制工程",
      "空间信息与数字技术",
      "电气工程及其自动化",
      "光电信息科学与工程",
      "数据科学与大数据技术",
      "计算机科学与技术（师范）",
      "电气工程及其自动化（师范）"
    ],
    "理学": [
      "应用化学",
      "物理学",
      "生物技术",
      "应用物理学",
      "应用心理学",
      "数学与应用数学",
      "信息与计算科学",
      "海洋技术（海洋工程与环境保护）"
    ],
    "经济学": [
      "国际经济与贸易"
    ],
    "管理学": [
      "财务管理",
      "行政管理",
      "物流工程",
      "工程管理",
      "工商管理",
      "工业工程",
      "公共事业管理",
      "信息管理与信息系统"
    ],
    "医学": [
      "药学",
      "中药学",
      "药物制剂"
    ],
    "法学": [
      "法学",
      "知识产权"
    ],
    "文学": [
      "汉语言文学",
      "英语",
      "日语",
      "广告学",
      "广播电视学"
    ],
    "艺术学": [
      "环境设计",
      "公共艺术",
      "视觉传达设计",
      "播音与主持艺术"
    ]
  },
  "浙江理工大学": {
    "工学": [
      "服装设计与工程",
      "轻化工程",
      "纺织工程",
      "电子信息工程",
      "计算机科学与技术",
      "机械设计制造及其自动化",
      "自动化",
      "风景园林",
      "通信工程",
      "软件工程",
      "生物制药",
      "材料化学",
      "工业设计",
      "土木工程",
      "机器人工程",
      "能源化工工程",
      "机械电子工程",
      "智能制造工程",
      "数字媒体技术",
      "能源与动力工程",
      "测控技术与仪器",
      "材料科学与工程",
      "智能科学与技术",
      "丝绸设计与工程",
      "高分子材料与工程",
      "非织造材料与工程",
      "海洋资源开发技术",
      "新能源材料与器件",
      "电器工程及其自动化",
      "建筑环境与能源应用工程",
      "建筑学"
    ],
    "理学": [
      "化学",
      "生物技术",
      "应用化学",
      "应用物理学",
      "应用心理学",
      "数学与应用数学",
      "信息与计算机科学"
    ],
    "经济学": [
      "金融学",
      "经济学",
      "经济统计学",
      "国际经济与贸易"
    ],
    "管理学": [
      "会计学",
      "行政管理",
      "电子商务",
      "工程管理",
      "工商管理",
      "工业工程",
      "人力资源管理",
      "大数据管理与应用",
      "信息管理与信息系统"
    ],
    "法学": [
      "法学",
      "社会工作"
    ],
    "文学": [
      "英语",
      "日语",
      "传播学",
      "汉语言文学"
    ],
    "艺术学": [
      "服装设计与工程",
      "产品设计",
      "环境设计",
      "艺术与科技",
      "视觉传达设计",
      "数字媒体技术",
      "美术学",
      "产品设计",
      "表演",
      "服装与服饰设计"
    ]
  },
  "浙江财经大学": {
    "工学": [
      "城乡规划",
      "人工智能",
      "数据科学与大数据技术",
      "软件工程（智慧金融方向）"
    ],
    "理学": [
      "应用统计学 "
    ],
    "经济学": [
      "金融学",
      "财政学",
      "经济学",
      "税收学",
      "投资学",
      "保险学",
      "金融科技",
      "金融工程",
      "金融数学",
      "数字经济",
      "国际税收",
      "信用管理",
      "经济统计学",
      "国际经济与贸易"
    ],
    "管理学": [
      "会计学",
      "审计学",
      "资产评估",
      "财务管理",
      "行政管理",
      "市场营销",
      "工程管理",
      "工商管理",
      "城市管理",
      "供应链管理",
      "土地资源管理",
      "人力资源管理",
      "劳动与社会保障",
      "市场营销（营销策划与市场推广方向）",
      "电子商务（互联网金融与商务智能方向）",
      "信息管理与信息系统（大数据管理与应用方向）"
    ],
    "法学": [
      "法学",
      "社会工作"
    ],
    "文学": [
      "英语",
      "日语",
      "广告学",
      "商务英语",
      "汉语言文学",
      "网络与新媒体",
      "汉语国际教育"
    ],
    "艺术学": [
      "摄影",
      "美术学",
      "书法学",
      "视觉传达设计"
    ]
  },
  "杭州电子科技大学": {
    "工学": [
      "通信工程",
      "软件工程",
      "信息安全",
      "电子信息工程",
      "电子科学与技术",
      "计算机科学与技术",
      "网络工程",
      "医学信息工程",
      "自动化",
      "车辆工程",
      "环境工程",
      "工业设计",
      "人工智能",
      "网络空间安全",
      "智能制造工程",
      "数字媒体技术",
      "信息对抗技术",
      "测控技术与仪器",
      "材料科学与工程",
      "智能科学与技术",
      "电气工程及其自动化",
      "光电信息科学与工程",
      "集成电路设计与集成系统",
      "机械设计制造及其自动化",
      "光电信息科学与工程（光电工程方向）"
    ],
    "理学": [
      "统计学",
      "信息与计算科学（英才班）",
      "信息物理学（物理英才班）",
      "数学与应用数学（金融数学、金融复合）",
      "数学与应用数学（金融数学）（金融复合）"
    ],
    "经济学": [
      "金融学",
      "经济学",
      "数字经济",
      "国际经济与贸易"
    ],
    "管理学": [
      "会计学",
      "审计学",
      "财务管理",
      "电子商务",
      "工商管理",
      "工业工程",
      "保密管理",
      "人力资源管理",
      "信息资源管理",
      "信息管理与信息系统"
    ],
    "法学": [
      "法学",
      "社会学"
    ],
    "文学": [
      "英语",
      "德语",
      "传播学",
      "汉语国际教育",
      "传播学（新媒体传播）"
    ],
    "艺术学": [
      "产品设计",
      "数字媒体艺术"
    ]
  },
  "中国计量大学": {
    "工学": [
      "自动化",
      "测控技术与仪器",
      "光电信息科学与工程",
      "通信工程",
      "生物工程",
      "环境工程",
      "工业设计",
      "安全工程",
      "功能材料",
      "人工智能",
      "电子信息工程",
      "机械电子工程",
      "智能感知工程",
      "食品质量与安全",
      "能源与动力工程",
      "电子科学与技术",
      "材料科学与工程",
      "计算机科学与技术",
      "微电子科学与工程",
      "电气工程及其自动化",
      "数据科学与大数据技术",
      "机械设计制造及其自动化"
    ],
    "理学": [
      "声学",
      "应用化学",
      "应用物理学",
      "数学与应用数学"
    ],
    "经济学": [
      "金融工程",
      "国际经济与贸易"
    ],
    "管理学": [
      "质量管理工程",
      "标准化工程",
      "财务管理",
      "行政管理",
      "市场营销",
      "工商管理",
      "工业工程",
      "信息管理与信息系统"
    ],
    "医学": [
      "药学",
      "卫生检验与检疫"
    ],
    "法学": [
      "法学",
      "知识产权"
    ],
    "文学": [
      "英语",
      "翻译",
      "广告学",
      "汉语言文学",
      "汉语国际教育"
    ],
    "农学": [
      "动植物检疫"
    ],
    "艺术学": [
      "环境设计"
    ]
  },
  "浙江农林大学": {
    "工学": [
      "木材科学与工程",
      "风景园林",
      "生物制药",
      "测绘工程",
      "工业设计",
      "城乡规划",
      "土木工程",
      "物联网工程",
      "电子信息工程",
      "食品质量与安全",
      "食品科学与工程",
      "环境科学与工程",
      "智能装备与系统",
      "智能科学与技术",
      "家具设计与工程",
      "高分子材料与工程",
      "计算机科学与技术",
      "数据科学与大数据技术",
      "机械设计制造及其自动化",
      "建筑学"
    ],
    "理学": [
      "生物技术",
      "应用化学",
      "应用统计学",
      "地理信息科学",
      "生态学（生态工程技术）"
    ],
    "经济学": [
      "金融工程",
      "数字经济",
      "国际经济与贸易"
    ],
    "管理学": [
      "会计学",
      "电子商务",
      "旅游管理",
      "工商管理",
      "城市管理",
      "农林经济管理",
      "文化产业管理（茶文化）"
    ],
    "医学": [
      "中药学"
    ],
    "法学": [
      "法学"
    ],
    "文学": [
      "英语",
      "广告学",
      "汉语言文学"
    ],
    "农学": [
      "林学",
      "园艺",
      "园林",
      "茶学",
      "农学",
      "植物保护",
      "智慧农业",
      "动物科学",
      "农业资源与环境",
      "设施农业科学与工程"
    ],
    "艺术学": [
      "视觉传达设计",
      "数字媒体艺术",
      "服装与服饰设计",
      "环境设计（园林艺术设计）"
    ]
  },
  "杭州师范大学": {
    "工学": [
      "计算机科学与技术",
      "计算机科学与技术（师范）",
      "计算机科学与技术（金融信息服务方向）",
      "软件工程",
      "环境工程",
      "工业设计",
      "制药工程",
      "电子信息工程",
      "高分子材料与工程",
      "数据科学与大数据技术",
      "机械设计制造及其自动化"
    ],
    "理学": [
      "化学",
      "生物科学",
      "化学（师范）",
      "生物科学（师范）",
      "统计学",
      "生态学",
      "生物技术",
      "应用化学",
      "应用心理学",
      "地理信息科学",
      "物理学（师范）",
      "数学与应用数学（师范）"
    ],
    "经济学": [
      "经济学",
      "金融工程",
      "数字经济"
    ],
    "管理学": [
      "健康服务与管理",
      "会计学",
      "行政管理",
      "电子商务",
      "国际商务",
      "文化产业管理",
      "大数据管理与应用",
      "公共事业管理（卫生事业管理方向）"
    ],
    "医学": [
      "药学",
      "护理学",
      "预防医学",
      "基础医学",
      "口腔医学",
      "临床医学"
    ],
    "法学": [
      "法学",
      "社会学",
      "社会工作",
      "知识产权",
      "思想政治教育（师范）"
    ],
    "文学": [
      "英语",
      "翻译",
      "日语",
      "朝鲜语",
      "汉语言文学",
      "英语（师范）",
      "汉语国际教育",
      "汉语言文学（师范）"
    ],
    "历史学": [
      "历史学（师范）"
    ],
    "教育学": [
      "小学教育",
      "小学教育（师范）",
      "运动训练",
      "休闲体育",
      "科学教育（师范）",
      "特殊教育（师范）",
      "学前教育（师范）",
      "体育教育（师范）",
      "教育技术学（师范）"
    ],
    "艺术学": [
      "音乐学",
      "音乐学（师范）",
      "绘画",
      "动画",
      "环境设计",
      "公共艺术",
      "视觉传达设计",
      "数字媒体艺术",
      "广播电视编导",
      "舞蹈学（师范）",
      "美术学（师范）",
      "播音与主持艺术"
    ]
  },
  "浙江工商大学": {
    "工学": [
      "食品质量与安全",
      "计算机科学与技术",
      "通信工程",
      "软件工程",
      "生物工程",
      "环境科学",
      "环境工程",
      "城乡规划",
      "信息安全",
      "人工智能",
      "物联网工程",
      "电子信息工程",
      "食品科学与工程",
      "环境科学与工程",
      "给排水科学与工程",
      "数据科学与大数据技术"
    ],
    "理学": [
      "应用统计学",
      "数学与应用数学"
    ],
    "经济学": [
      "金融学",
      "经济学",
      "投资学",
      "保险学",
      "金融工程",
      "数字经济",
      "经济统计学",
      "国际经济与贸易"
    ],
    "管理学": [
      "会计学",
      "工商管理",
      "会计学（ACCA方向）",
      "审计学",
      "酒店管理",
      "财务管理",
      "行政管理",
      "电子商务",
      "物流管理",
      "旅游管理",
      "慈善管理",
      "市场营销",
      "国际商务",
      "文化产业管理",
      "土地资源管理",
      "人力资源管理",
      "信息管理与信息系统"
    ],
    "法学": [
      "法学",
      "社会工作",
      "知识产权"
    ],
    "哲学": [
      "哲学"
    ],
    "文学": [
      "商务英语",
      "英语",
      "法语",
      "日语",
      "新闻学",
      "广告学",
      "传播学",
      "阿拉伯语",
      "汉语言文学",
      "网络与新媒体"
    ],
    "历史学": [
      "历史学"
    ],
    "艺术学": [
      "环境设计",
      "产品设计",
      "视觉传达设计",
      "数字媒体艺术"
    ]
  },
  "浙大城市学院": {
    "工学": [
      "自动化",
      "通信工程",
      "软件工程",
      "智能建造",
      "工业设计",
      "土木工程",
      "人工智能",
      "电子信息工程",
      "机械电子工程",
      "智能制造工程",
      "电子科学与技术",
      "计算机科学与技术",
      "数据科学与大数据技术",
      "机械设计制造及其自动化",
      "建筑学",
      "城乡规划"
    ],
    "理学": [
      "统计学",
      "应用统计学"
    ],
    "经济学": [
      "金融学",
      "数字经济"
    ],
    "管理学": [
      "资产评估",
      "财务管理",
      "行政管理",
      "旅游管理",
      "工商管理",
      "国际管理"
    ],
    "医学": [
      "药学",
      "护理学",
      "临床医学"
    ],
    "           法学": [
      "法学"
    ],
    "文学": [
      "英语",
      "日语",
      "德语",
      "新闻学",
      "广告学",
      "商务英语",
      "汉语言文学",
      "广播电视学"
    ],
    "历史学": [
      "考古学",
      "历史学"
    ],
    "艺术学": [
      "环境设计",
      "视觉传达设计"
    ]
  },
  "浙江传媒学院": {
    "工学": [
      "软件工程",
      "网络工程",
      "电影制作",
      "人工智能",
      "虚拟现实技术",
      "数字媒体技术",
      "广播电视工程",
      "电子科学与技术"
    ],
    "经济学": [
      "经济学"
    ],
    "管理学": [
      "公共关系学",
      "文化产业管理",
      "会展经济与管理"
    ],
    "文学": [
      "英语",
      "新闻学",
      "广告学",
      "传播学",
      "编辑出版学",
      "汉语言文学",
      "广播电视学",
      "网络与新媒体"
    ],
    "艺术学": [
      "广播电视编导",
      "播音与主持艺术（礼仪文化）",
      "播音与主持艺术（影视配音）",
      "播音与主持艺术（双语播音）",
      "表演",
      "摄影",
      "动画",
      "音乐剧",
      "音乐表演",
      "舞蹈编导",
      "录音艺术",
      "产品设计",
      "艺术与科技",
      "视觉传达设计",
      "数字媒体艺术",
      "戏剧影视文学",
      "戏剧影视导演",
      "动画（漫插画）",
      "戏剧影视美术设计",
      "影视摄影与制作（电视摄影）",
      "服装与服饰设计（中外合作办学）",
      "影视摄影与制作（电视节目制作）"
    ]
  }
}

module.exports = {
  schoolCategoryMajor
}